In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

#### Info on unique values

In [3]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [4]:
df['col2'].nunique() # total number of unique values

3

In [5]:
df['col2'].value_counts()

444    2
666    1
555    1
Name: col2, dtype: int64

#### Selecting Data

In [6]:
newdf = df[(df['col1']>2) & (df['col2']==444)]

In [7]:
newdf

   col1  col2 col3
3     4   444  xyz

#### Applying Function

In [8]:
def times(x):
    return x*2

In [9]:
df['col1'].apply(times)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [10]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [11]:
df['col1'] = df['col1'].apply(times)

In [12]:
df

   col1  col2 col3
0     2   444  abc
1     4   555  def
2     6   666  ghi
3     8   444  xyz

In [13]:
# checking length of string
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

#### Permanently removing a Column

In [14]:
del df['col1']

In [15]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [16]:
# Get Column name
df.columns

Index(['col2', 'col3'], dtype='object')

In [17]:
# Get index name
df.index

RangeIndex(start=0, stop=4, step=1)

#### Sorting

In [18]:
df.sort_values(by = 'col2')

   col2 col3
0   444  abc
3   444  xyz
1   555  def
2   666  ghi

#### Checking and droping null values

In [19]:
df.isnull()

    col2   col3
0  False  False
1  False  False
2  False  False
3  False  False

In [20]:
df.isnull().any()

col2    False
col3    False
dtype: bool

In [21]:
df.dropna()

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

#### Filling and Droping NaN values

In [22]:
df = pd.DataFrame({'col1':[1,2,3,np.nan],
                   'col2':[np.nan,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [23]:
df.dropna()

   col1   col2 col3
1   2.0  555.0  def
2   3.0  666.0  ghi

In [24]:
df

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [25]:
df.fillna('Fill')

   col1   col2 col3
0   1.0   Fill  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3  Fill  444.0  xyz

In [26]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [27]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [28]:
df.pivot_table(values = 'D', index = ["A", "B"], columns = ['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN